/* --- Levels data --- */

const levels = [
    // level 1
    {
        id: 1,
        // 要在工具箱中显示的块
        blocks: [
            'move',
            'turn'
        ],
        // 游戏数据
        game: {
            // pegman data
            pegman: {
                direction: 1,
                x: 0,
                y: 0
            },  
            // 标记数据
            marker: {
                x: 2,
                y: 1
            },
            // 游戏路径
            path: [
                // [x, y]
                [0, 0],
                [1, 0],
                [1, 1],
                [2, 1]
            ]
        }
    },
    //level 2
    {
        id: 2,
        //允许的最大块数
        maxBlocks: 22,
        //游戏数据
        game: {
            // 小人数据
            pegman: {
                direction: 1,
                x: 0,
                y: 0
            },
            // 标记数据
            marker: {
                x: 3,
                y: 5
            },
            // 游戏路径
            path: [
                // [x, y]
                [0, 0],
                [1, 0],
                [2, 0],
                [3, 0],
                [2, 1],
                [2, 2],
                [2, 3],
                [1, 2],
                [0, 2],
                [0, 3],
                [0, 4],
                [0, 5],
                [1, 4],
                [1, 5],
                [3, 2],
                [4, 2],
                [5, 2],
                [5, 1],
                [5, 0],
                [4, 3],
                [4, 4],
                [3, 4],
                [3, 5],
                [4, 4],
                [5, 4],
                [5, 5],
            ]
        }
    },
    //level 3
    {
        id: 3,
        //允许的最大块数
        maxBlocks: 30,
        //游戏数据
        game: {
            // 小人数据
            pegman: {
                direction: 1,
                x: 0,
                y:0
            },
            // 标记数据
            marker: {
                x: 5,
                y: 0
            },
            // 游戏路径
            path: [
                // [x, y]
                [0, 0],
                [1, 0],
                [2, 0],
                [3, 0],
                [4,0],
                [5,0]
                
            ]
        }
    },
//level 4
    {
        id: 4,
        //允许的最大块数
        maxBlocks: 10,
        //游戏数据
        game: {
            // 小人数据
            pegman: {
                direction: 1,
                x: 0,
                y: 0
            },
            // 标记数据
            marker: {
                x: 2,
                y: 5
            },
            // 游戏路径
            path: [
                // [x, y]
                [0, 0],
                [1, 0],
                [2, 0],
                [2, 1],
                [2, 2],
                [2, 3],
                [2, 4],
                [2, 5],
            ]
        }
    },
//level 5
    {
        id: 5,
        //允许的最大块数
        maxBlocks: 30,
        //游戏数据
        game: {
            // 小人数据
            pegman: {
                direction: 1,
                x: 0,
                y: 0
            },
            // 标记数据
            marker: {
                x: 2,
                y: 2
            },
            // 游戏路径
            path: [
                // [x, y]
                [0, 0],
                [1, 0],
                [2, 0],
                [3, 0],
                [4, 0],
                [4, 1],
                [4, 2],
                [4, 3],
                [4, 4],
                [3,4],
                [2,4],
                [1,4],
                [0,4],
                [0,3],
                [0,2],
                [1,2],
                [2,2]
                // [0,4],
                // [0,3],
                // [0,2],
                // [1,2],
                // [2,2],
                // [3,2]
               
            ]
        }
    },
//level 6
    {
        id: 6,
        //允许的最大块数
        maxBlocks: 10,
        //游戏数据
        game: {
            // 小人数据
            pegman: {
                direction: 1,
                x: 0,
                y: 0
            },
            // 标记数据
            marker: {
                x: 3,
                y: 5
            },
            // 游戏路径
            path: [
                // [x, y]
                [0, 0],
                [1, 0],
                [2, 0],
                [2, 1],
                [2, 2],
                [1, 2],
                [0, 2],
                [0, 3],
                [0, 4],
                [1, 4],
                [2, 4],
                [3, 4],
                [3, 3],
                [4, 3],
                [4, 2],
                [4, 1],
                [4, 0],
            ]
        }
    }
]